In [7]:
import pandas as pd

### 1)

In [8]:
data = [4, 8, 15, 16, 23, 42]
ser1 = pd.Series(data)

In [9]:
ser1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### 2)

In [10]:
data1 = [1,2,3,4,5,6,7,8,9,10]
ser2 = pd.Series(data1)

In [11]:
ser2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### 3)

In [12]:
data4 = [['Alice','Bob','Claire'],[25,30,27],['Female','Male','Female']]

In [13]:
df = pd.DataFrame(data4,columns=['Name','Age','Gender'])

In [14]:
df

     Name   Age  Gender
0   Alice   Bob  Claire
1      25    30      27
2  Female  Male  Female

### 4)

* Dataframe => A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and                     columns.
* Series => A Pandas Series is like a column in a table.It is a one-dimensional array holding data of any type.

In [15]:
# example of dataframe 
df

     Name   Age  Gender
0   Alice   Bob  Claire
1      25    30      27
2  Female  Male  Female

In [17]:
# example of series
ser1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### 5)

* Common function that we can use for data manipulation in pandas are head(),tail(),dtypes,columns etc
* e.g. head()=> it can be used to see top n records of dataframe

### 6)

* DataFrame and Panel are mutable

### 7)

In [18]:
name = ['vivek','raj','shubh']
age = [10,20,30]

In [19]:
name_series = pd.Series(name)
age_series = pd.Series(age)

In [20]:
name_series

0    vivek
1      raj
2    shubh
dtype: object

In [21]:
age_series

0    10
1    20
2    30
dtype: int64

In [22]:
headres = {"Name":name_series,"Age":age_series}

In [23]:
df2 = pd.DataFrame(headres)

In [24]:
df2

    Name  Age
0  vivek   10
1    raj   20
2  shubh   30